using System.Collections.Generic;

namespace DesignPatterns.Structural
{
    /// <summary>
    /*
     Паттерн Компоновщик имеет смысл только тогда, когда основная модель вашей программы может быть структурирована в виде дерева.

    Например, есть два объекта: Продукт и Коробка. Коробка может содержать несколько Продуктов и других Коробок поменьше.
    Те, в свою очередь, тоже содержат либо Продукты, либо Коробки и так далее.

    Теперь предположим, ваши Продукты и Коробки могут быть частью заказов.
    Каждый заказ может содержать как простые Продукты без упаковки, так и составные Коробки.
    Ваша задача состоит в том, чтобы узнать цену всего заказа.


    Если решать задачу в лоб, то вам потребуется открыть все коробки заказа, перебрать все продукты и посчитать их суммарную стоимость.
    Но это слишком хлопотно, так как типы коробок и их содержимое могут быть вам неизвестны.
    Кроме того, наперёд неизвестно и количество уровней вложенности коробок, поэтому перебрать коробки простым циклом не выйдет.

    Компоновщик предлагает рассматривать Продукт и Коробку через единый интерфейс с общим методом получения стоимости.

    Продукт просто вернёт свою цену. Коробка спросит цену каждого предмета внутри себя и вернёт сумму результатов.
    Если одним из внутренних предметов окажется коробка поменьше, она тоже будет перебирать своё содержимое, и так далее, пока не будут посчитаны все составные части.

    Компоновщик рекурсивно запускает действие по всем элементам дерева — от корня к листьям.

    Для вас, клиента, главное, что теперь не нужно ничего знать о структуре заказов.
    Вы вызываете метод получения цены, он возвращает цифру, а вы не тонете в горах картона и скотча.

     */
    /// </summary>
    public class Composite
    {
        #region Composite

        public interface IProduct
        {
            int GetPrice();
        }

        public class Bread : IProduct
        {
            public int GetPrice() => 5;
        }

        public class Milk : IProduct
        {
            public int GetPrice() => 10;
        }

        public class Box : IProduct
        {
            IList<IProduct> components;

            public Box()
            {
                components = new List<IProduct>();
            }

            public void Add(IProduct product) => components.Add(product);

            public void Remove(IProduct product) => components.Remove(product);

            public int GetPrice()
            {
                var sum = 0;
                foreach(var comp in components)
                {
                    sum += comp.GetPrice();
                }

                return sum;
            }
        }

        #endregion
    }
}
