using System.Collections.Generic;
using System.Text;

namespace DesignPatterns.Structural
{
    /// <summary>
    /*
     Вы работаете над библиотекой оповещений, которую можно подключать к разнообразным программам, чтобы получать уведомления о важных событиях.

    Основой библиотеки является класс Notifier с методом send, который принимает на вход строку-сообщение и высылает её всем администраторам по электронной почте.
    Сторонняя программа должна создать и настроить этот объект, указав кому отправлять оповещения, а затем использовать его каждый раз, когда что-то случается.

    В какой-то момент стало понятно, что одних email-оповещений пользователям мало.
    Некоторые из них хотели бы получать извещения о критических проблемах через SMS. Другие хотели бы получать их в виде сообщений Facebook.
    Корпоративные пользователи хотели бы видеть сообщения в Slack.

    Наследование — это первое, что приходит в голову многим программистам, когда нужно расширить какое-то существующее поведение. Но механизм наследования имеет несколько досадных проблем.

    Он статичен. Вы не можете изменить поведение существующего объекта. Для этого вам надо создать новый объект, выбрав другой подкласс.
    Он не разрешает наследовать поведение нескольких классов одновременно. Из-за этого вам приходится создавать множество подклассов-комбинаций для получения совмещённого поведения.
    Одним из способов обойти эти проблемы является замена наследования агрегацией либо композицией .
    Это когда один объект содержит ссылку на другой и делегирует ему работу, вместо того чтобы самому наследовать его поведение. Как раз на этом принципе построен паттерн Декоратор.

    Декоратор имеет альтернативное название — обёртка. Оно более точно описывает суть паттерна: вы помещаете целевой объект в другой объект-обёртку, который запускает базовое поведение объекта, а затем добавляет к результату что-то своё.

    Оба объекта имеют общий интерфейс, поэтому для пользователя нет никакой разницы, с каким объектом работать — чистым или обёрнутым.
    Вы можете использовать несколько разных обёрток одновременно — результат будет иметь объединённое поведение всех обёрток сразу.

    В примере с оповещениями мы оставим в базовом классе простую отправку по электронной почте, а расширенные способы отправки сделаем декораторами.

    Сторонняя программа, выступающая клиентом, во время первичной настройки будет заворачивать объект оповещений в те обёртки, которые соответствуют желаемому способу оповещения.

    Последняя обёртка в списке и будет тем объектом, с которым клиент будет работать в остальное время. Для остального клиентского кода, по сути, ничего не изменится, ведь все обёртки имеют точно такой же интерфейс, что и базовый класс оповещений.

    Таким же образом можно изменять не только способ доставки оповещений, но и форматирование, список адресатов и так далее. К тому же клиент может «дообернуть» объект любыми другими обёртками, когда ему захочется.
     */
    /// </summary>
    public class Decorator
    {
        #region Notifier

        public interface INotifier
        {
            string Notify();
        }

        public class SmsNotifier : INotifier
        {
            public string Notify() => "Sms notify";
        }

        public class EmailNotifier : INotifier
        {
            public string Notify() => "Email notify";
        }

        public class MessengerNotifier : INotifier
        {
            public string Notify() => "Messenger notify";
        }

        #endregion

        #region Decorator

        public class BasicNotifierWrapper : INotifier
        {
            INotifier notifier;

            public BasicNotifierWrapper(INotifier notifier)
            {
                this.notifier = notifier;
            }
            public string Notify()
            {
                return $"It is from decorator - { notifier.Notify() }";
            }
        }

        public class AlarmNotifierWrapper : INotifier
        {
            INotifier notifier;
            INotifier alarmNotifier;

            public AlarmNotifierWrapper(INotifier notifier, INotifier alarmNotifier)
            {
                this.notifier = notifier;
                this.alarmNotifier = alarmNotifier;
            }
            public string Notify()
            {
                return $"It is from alarm decorator - { alarmNotifier.Notify() } ; { notifier.Notify() }";
            }
        }

        #endregion
    }
}
